e27182/nRF52832_pesky/ble_peripheral/ble_app_hids_mouse_md612/main.c
        buffer[0] = buttons; // Left button (bit 0), Right (bit 1), Middle (bit 2)
        buffer[1] = 0; // Scroll value (-127, 128)
        buffer[2] = 0; // Sideways scroll value (-127, 128)

        err_code = ble_hids_inp_rep_send(&m_hids,
                                         INPUT_REP_BUTTONS_INDEX, 
                                         INPUT_REP_BUTTONS_LEN, 
                                         buffer);
    }

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist();
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        case BSP_EVENT_KEY_0:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                mouse_movement_send(0, -MOVEMENT_SPEED, 0);
            }
            break;

        case BSP_EVENT_KEY_1:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                mouse_movement_send(0, 0, -MOVEMENT_SPEED);
            }
            break;

        case BSP_EVENT_KEY_2:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                mouse_movement_send(0, MOVEMENT_SPEED, 0);
            }
            break;

        case BSP_EVENT_KEY_3:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                mouse_movement_send(0, 0, MOVEMENT_SPEED);
            }
            break;

        default:
            break;
    }
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

static void md612_callback(unsigned char type, long *data, int8_t accuracy, unsigned long timestamp, unsigned short tap)
{
    uint8_t buttons = 0x00;

    if (tap)
    {
        unsigned char direction = (tap & 0xFF00) >> 8;
        //unsigned char count = (tap & 0x00FF) >> 0;

        switch (direction) {
        case TAP_X_UP:
        case TAP_X_DOWN:
            buttons |= 0x04;
            break;
        case TAP_Y_UP:
        case TAP_Y_DOWN:
            buttons |= 0x02;
            break;
        case TAP_Z_UP:
        case TAP_Z_DOWN:
            buttons |= 0x01;
            break;
        default:
            return;
        }
    }

    switch(type)
    {
        case PACKET_DATA_EULER:
        {
            float x = inv_q16_to_float(data[0]);
            float y = inv_q16_to_float(data[1]);
            float z = inv_q16_to_float(data[2]);

            int16_t delta_x = (x - old_data[0]) * 50;
            int16_t delta_y = (y - old_data[1]) * 50;

            old_data[0] = x;
            old_data[1] = y;
            old_data[2] = z;

            if (buttons)
                NRF_LOG_INFO("[%d] Buttons: %d\r\n", timestamp, buttons);

            //NRF_LOG_INFO("[%d] Accuracy: %d\r\n", timestamp, accuracy);
            //NRF_LOG_INFO("[%d] Euler: [%d %d %d] Delta: [%d %d]\r\n", timestamp, x, y, z, delta_x, delta_y);

            if (ble_conn_state_encrypted(m_conn_handle))
                mouse_movement_send(buttons, delta_y, delta_x);
        }
        break;
        case PACKET_DATA_QUAT:
        {
            int16_t delta_x, delta_y;

            delta_x = (data[0] - old_data[0]) / 100000;
            delta_y = (data[1] - old_data[1]) / 100000;

            old_data[0] = data[0];
            old_data[1] = data[1];
            old_data[2] = data[2];
            old_data[3] = data[3];

            if (ble_conn_state_encrypted(m_conn_handle))
                mouse_movement_send(buttons, delta_x, delta_y);
        }
        break;
        default:
        break;
    }
}

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    NRF_LOG_ERROR("Fatal: %d %d %d\r\n", id, pc, info)
    NRF_LOG_FINAL_FLUSH();
    // On assert, the system can only recover with a reset.
#ifndef DEBUG
    NVIC_SystemReset();
#else
    app_error_save_and_stop(id, pc, info);
#endif // DEBUG
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool     erase_bonds;
    uint32_t err_code;

    // Initialize.
    err_code = NRF_LOG_INIT(timestamp_func);
    APP_ERROR_CHECK(err_code);

    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    scheduler_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();

    NRF_LOG_INFO("Motion Driver init...\r\n");
    md612_configure(md612_callback);
    md612_selftest();

    // Start execution.
    NRF_LOG_INFO("HID Mouse Start!\r\n");
    timers_start();
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        md612_beforesleep();

        if (NRF_LOG_PROCESS() == false && md612_hasnewdata() == false)
        {
            power_manage();
            continue;
        }

        md612_aftersleep();
    }
}


/**
 * @}
 */
